package com.example.nav_graph_classwork

import com.example.nav_graph_classwork.models.ModelClass

abstract class Constants {
    companion object{
        val array = arrayListOf(
            ModelClass(
                "https://upload.wikimedia.org/wikipedia/commons/9/9a/Gull_portrait_ca_usa.jpg",
                "чайка",
                "Южная",
                "Ча́йки[1] (лат. Larus) — наиболее многочисленный род птиц семейства чайковых, " +
                        "обитающих как на морских просторах, так и на внутренних водоёмах. " +
                        "Многие виды считаются синантропными — они живут вблизи человека и получают от этого выгоду."
            ),ModelClass(
                "https://upload.wikimedia.org/wikipedia/commons/9/9a/Gull_portrait_ca_usa.jpg",
                "чайка",
                "Южная",
                "Ча́йки[1] (лат. Larus) — наиболее многочисленный род птиц семейства чайковых, " +
                        "обитающих как на морских просторах, так и на внутренних водоёмах. " +
                        "Многие виды считаются синантропными — они живут вблизи человека и получают от этого выгоду."
            ),ModelClass(
                "https://upload.wikimedia.org/wikipedia/commons/9/9a/Gull_portrait_ca_usa.jpg",
                "чайка",
                "Южная",
                "Ча́йки[1] (лат. Larus) — наиболее многочисленный род птиц семейства чайковых, " +
                        "обитающих как на морских просторах, так и на внутренних водоёмах. " +
                        "Многие виды считаются синантропными — они живут вблизи человека и получают от этого выгоду."
            ),
            ModelClass(
                "https://upload.wikimedia.org/wikipedia/commons/9/9a/Gull_portrait_ca_usa.jpg",
                "чайка",
                "Южная",
                "Ча́йки[1] (лат. Larus) — наиболее многочисленный род птиц семейства чайковых, " +
                        "обитающих как на морских просторах, так и на внутренних водоёмах. " +
                        "Многие виды считаются синантропными — они живут вблизи человека и получают от этого выгоду."
            ),
            ModelClass(
                "https://upload.wikimedia.org/wikipedia/commons/9/9a/Gull_portrait_ca_usa.jpg",
                "чайка",
                "Южная",
                "Ча́йки[1] (лат. Larus) — наиболее многочисленный род птиц семейства чайковых, " +
                        "обитающих как на морских просторах, так и на внутренних водоёмах. " +
                        "Многие виды считаются синантропными — они живут вблизи человека и получают от этого выгоду."
            ),

        )
    }
}